## Plan for terraform
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show Summary</summary>

|  CHANGE  |                             NAME                              |
|----------|---------------------------------------------------------------|
| recreate | `aws_lambda_layer_version.lambda_layer`                       |
|          | `aws_lambda_layer_version_permission.lambda_layer_permission` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_layer_version.lambda_layer must be replaced
-/+ resource "aws_lambda_layer_version" "lambda_layer" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:21" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-12-14T19:46:32.013+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:21" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "qHnw2hQ5QD8VBTtG9Wy2FgQ+r57zH27Y6Bi7+xdhkos=" -> "t4Gyxh+0UjttieITi1Z/r0OscqB21bBjPYjEClnaFkQ=" # forces replacement
      ~ source_code_size            = 10341999 -> (known after apply)
      ~ version                     = "21" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version_permission.lambda_layer_permission must be replaced
-/+ resource "aws_lambda_layer_version_permission" "lambda_layer_permission" {
      ~ id             = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer,21" -> (known after apply)
      ~ layer_name     = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer" -> (known after apply) # forces replacement
      ~ policy         = jsonencode(
            {
              - Id        = "default"
              - Statement = [
                  - {
                      - Action    = "lambda:GetLayerVersion"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:21"
                      - Sid       = "shared-layer-permission"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ revision_id    = "14ffbb09-c0a0-4b9b-9f0e-51b541e8a1b2" -> (known after apply)
      ~ version_number = 21 -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
